          <?php
         include('connect.php');
         include('header.php');
        /// include('search.php');

         ?>
          <div class="container center">
            <h4 style="padding-top: 20px;">حول الموقع</h4>
          <p>
            بسم الله الرحمن الرحيم

            الحمدلله رب العالمين والصلاة والسلام على سيدنا محمد وعلى آله واصحابه اجمعين.ثم اما بعد............ هذا تقرير وصف الموقع الذي تم إنشاءه وهو موقع المكتبة العلمية هذا الموقع يتميز على واجهة مكتبة وتتكون وأيقونة الواجهة من صورة رئسية للواجهة ومشغل بحث والذي تبحث فيه عن أي كتاب تريده.وأيضاً يوجد عدد من الازرره للبحث السريع بجانب زر القائمة الرئيسية مثال: ( وبعد ذلك يوجد فهرس تحت القائمة الرئيسية ويوجد مقابل الفهرس محتوى للكتب يكون ذلك لتصفح الكتاب أي للقراءة. بل يكون للأستعلام عن نبذة الكتاب ومؤلفه ومصدره .ويوجد زر لتحميل الكتاب او مشاركة رابط الكتاب او تصفح الكتاب... بنسبة للفهرس يكون تحت مسمى قائمة المكتبة. هذا الفهرس يوجد فيه كتب اسلاميه , وكتب تاريخية , وكتب ثقافيه ,وكتب اجتماعية, وكتب تكنولوجيا,ومناهج دراسية,ورسائل جامعية وأخرى..... وايضاً يوجد فهرس داخل كل خليه من قائمة المكتبة مثل عندما نختاركتب اسلاميه من فهرس المكتبة يوجد داخل صفحة الكتب الاسلاميه فهرس يعرض جميع الكتب الاسلاميه سوا في كتب التفاسير او الحديث او الفقه او السًّير. وهكذا جميع كل الخيارات الموجودة في قائمة المكتبة يوجد فهارس لها مختص لها كا فهرس الكتب الأاسلامية وفهرس الكتب الثقافية وفهرس الكتب التاريخية وفهرس كتب التكنولوجيا ووفهرس...الخ...... وأيضاً فعلنا حساب اكتروني في المكتبة وهذا يظهر في المكتبة تحت الفهرس يوجد مربع فيه دخل المستخدم وادخل كلمة المرور هذا يكون لمن كان له حساب في الموقع واما القارئ او المستخدم الجديد يمكن ان ينشأ له حساب ويوجد زر إنشاء حساب تحت مربع اسم المستخدم و كلمة المرور كما هو موضح في الصورة .... وهذه المكتبة تستهدف المثقفين من أصحاب القراءة والمطالعة في جميع شتى العلوم وأصحاب الأبحاث في جميع فنون العلم. وايضاً أصحاب رسائل الماجستر والدكتورة الذين هم في سعة الأحتياج للكتب والمراجع العلمية والرسائل الجامعية وهذا يكون عبر المكتبات الألكترونية. فالذلك المكتبات الألكترونية توفر وتسهل لهم طرق البحث السريعة والمطالعة وهذه المكتبات الألكترونية لا تكون إلا لمن تصعب عنده الأمكانيات في شراء الكتب والمراجع.وبعض الآخرين حتى ولو كان لديهم أمكانيات لبعض الكتب لكن لا يستطيع شراء مكتبة مكتملة بالكتب والمراجع من شتى العلوم والفنون.فالذلك نحن نوفر لهم هذه المكتبة ليسهل عليهم للحصول على جميع الكتب والمراجع العلمية و ليتيسر لهم طرق البحث وجمع المعلومات وايضاً ليتوفر لهم وقت يستغل في البحث والمطالعة والمناقشة والتأليف. وايضاً طلاب المدارس والجامعات والمعاهد والمراكز العلمية والثقافية يمكنهم الحصول على الكتب والرسائل والأبحاث والرويات للمطالعة والتزود من الثقافة والمعرفة وتنمية العقل في جميع المجالات وجميع العلوم والفنون .هذا من جانب الثقافة..اما من جانب التخصصات الجامعيه او المعاهد فاطلاب الجامعه والمعاهد محتاجين للتطور في تخصصاتهم والبحث على
             المعلومات والمراجع المناسبه لمجالتهم سوا في العلوم الشرعيه او الأدبية او جميع علوم الآلة
             او العلوم الهندسية والتقنية. فهم محتاجين لتطوير انفسهم اكثر واكثر. ويوجد في المكتبة
             مناهج الجامعات والمعاهد الذي تلبي احتياج الطالب المعسر الذي ليس لديه إمكانية في شراء
             المنهج الدراسي ويمكن تنزيل المنهج صيغة بي دي اف ويتم مطالعته اكترونياً. فا لذلك نحن قمنا
             بصناعة موقع أنترنت خاص بالمكتبة وقد هدفنا في هذا العمل لأجل توفيرمكتبة علمية أكترونية
             وتتكون هذه المكتبة كما قلنا سابقاً من جميع الكتب والمراجع من شتى العلوم 
            والفنون والذي يستفيد منها طلاب العلم سواء طلاب الجامعات او المعاهد او المؤسسات التعليمية
            .ويستفيد طلاب التعليم العالي كأصحاب الرسائل الماجستر والدكتوره. ويستفيد منها المثقفين
             والمدمنين على الأطلاع و قراءة الكتب وأصحاب البحوثات والمشاريع العلمية... وهذا وشكراً............
          </p>
          </div>

        <!--jquery-->
        <script src="js/jquery-3.6.0.min.map"> </script>
        <!--script src="js/jquery-3.6.0.slim.min.map"></script-->
        <!--JavaScript at end of body for optimized loading-->
        <script  src="js/materialize.min.js"></script>
        <script>
            document.addEventListener('DOMContentLoaded', function() {
    var elems = document.querySelectorAll('.sidenav');
    var instances = M.Sidenav.init(elems, options);
  });
        </script>
        <script>
           $(document).ready(function(){
          $('.sidenav').sidenav();
       });
        </script>
             <br> <br> <br> <br> <br> <br> <br> <br> <br> <br> <br> <br> <br>

     

    
</body>
</html>
<?php  include('footer.php'); ?>